import numpy as np
import pandas as pd

#访问数据

np.random.seed(20201212)
df = pd.DataFrame(np.random.randn(6, 4), index=pd.date_range('20210101', periods=6), columns=list('ABCD'))
# print(df)

# print(df.head(2))
# print(df.tail(3))

# print(df.describe())
#               A         B         C         D
# count  6.000000  6.000000  6.000000  6.000000
# mean   0.082540  0.049755 -0.181309  0.228960
# std    0.551412  1.078337  0.933155  1.131143
# min   -0.816064 -1.403839 -1.645924 -1.271799
# 25%   -0.180000 -0.553043 -0.737194 -0.587269
# 50%    0.298188 -0.134555  0.106933  0.287363
# 75%    0.342885  0.987901  0.556601  1.168049
# max    0.696541  1.301966  0.656281  1.488036
# count表示计数。A列有6个数据不为空。
# mean表示平均值。A列所有不为空的数据平均值为0.0825402。
# std表示标准差。A列的标准差为0.551412。
# min表示最小值。A列最小值为-0.816064。即，0%的数据比-0.816064小。
# 25%表示四分之一分位数。A列的四分之一分位数为-0.18。即，25%的数据比-0.18小。
# 50%表示二分之一分位数。A列的四分之一分位数为0.298188。即，50%的数据比0.298188小。
# 75%表示四分之三分位数。A列的四分之三分位数为0.342885。即，75%的数据比0.342885小。
# max表示最大值。A列的最大值为0.696541。即，100%的数据比0.696541小。

# print(df.T)

# print(df.sort_values(by='C'))

# print(df.nlargest(2, 'C'))

# print(df.sample(5))

print(df.sample(frac=0.01))